АлогистикТест2/src/Documents/алк_УпаковкаНоменклатуры/алк_УпаковкаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УпаковкаНоменклатуры</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_РасформированиеПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаЗапасов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПродукции</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаЗапасов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПродукции</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.алк_ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияНоменклатурыПЭО</name>
      <type>
        <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
      </type>
    </attributes>
    <attributes>
      <name>Припуск</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомераПродукция</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПродукцияПФ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/СертификацияПродукции/СертификацияПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СертификацияПродукции</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/ОперацииСерийныхНомеров/ОперацииСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииСерийныхНомеров</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Движение</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
  <enumValues>
    <name>Расформирование</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Перевалка</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыОперацийПеремещениеЗапасов/алк_ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>ПередачаИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРасформированныхПакетов</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаУпаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственные</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеПакета</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСПереупаковки</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСушку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушки</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВСушильнуюКамеру</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСушильнойКамеры</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВНезавершенноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушкиСырых</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УПП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_СГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_Магазин</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыДвиженияПроизводствоОборот/алк_ВидыДвиженияПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДвиженияПроизводствоОборот</name>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Оприходовано</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ОперацииПроизводства</name>
  <predefined>
    <items>
      <name>Досушка</name>
      <description>Досушка</description>
    </items>
    <items>
      <name>Дробление</name>
      <description>Дробление</description>
    </items>
    <items>
      <name>Лущение</name>
      <description>Лущение</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Отгрузка</name>
      <description>Отгрузка</description>
    </items>
    <items>
      <name>ОтгрузкаСудна</name>
      <description>Отгрузка судна</description>
    </items>
    <items>
      <name>ПереданоВОтгрузку</name>
      <description>Передано в отгрузку</description>
    </items>
    <items>
      <name>ПеремещениеПриход</name>
      <description>Перемещение приход</description>
    </items>
    <items>
      <name>ПеремещениеРасход</name>
      <description>Перемещение расход</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортица</description>
    </items>
    <items>
      <name>Переупаковка</name>
      <description>Переупаковка</description>
    </items>
    <items>
      <name>Прибыло</name>
      <description>Прибыло</description>
    </items>
    <items>
      <name>Приемка</name>
      <description>Приемка</description>
    </items>
    <items>
      <name>ПриемкаВПорту</name>
      <description>Приемка в порту</description>
    </items>
    <items>
      <name>ПриемкаПоГОСТ</name>
      <description>Приемка по ГОСТ</description>
    </items>
    <items>
      <name>ПроизводствоПоддонов</name>
      <description>Производство поддонов</description>
    </items>
    <items>
      <name>ПроизводствоТопливныхБрикетов</name>
      <description>Производство топливных брикетов</description>
    </items>
    <items>
      <name>ПроизводствоФанеры</name>
      <description>Производство фанеры</description>
    </items>
    <items>
      <name>Разгружено</name>
      <description>Разгружено</description>
    </items>
    <items>
      <name>Распил</name>
      <description>Распил</description>
    </items>
    <items>
      <name>Ребросклей</name>
      <description>Ребросклей</description>
    </items>
    <items>
      <name>РучнаяСортировка</name>
      <description>Ручная сортировка</description>
    </items>
    <items>
      <name>СборкаРазборкаПакета</name>
      <description>Сборка/Разборка пакета</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
    <items>
      <name>Сушка</name>
      <description>Сушка</description>
    </items>
    <items>
      <name>Упаковка</name>
      <description>Упаковка</description>
    </items>
    <items>
      <name>УпаковкаФанеры</name>
      <description>Упаковка фанеры</description>
    </items>
    <items>
      <name>ФорматнаяОбрезка</name>
      <description>Форматная обрезка</description>
    </items>
    <items>
      <name>ЧисленныйСоставСмены</name>
      <description>Численный состав смены (общая)</description>
    </items>
    <items>
      <name>ШлифованиеФанеры</name>
      <description>Шлифование фанеры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗапросПолученияБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперацииДляЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИтогов</name>
    <type>
      <types>EnumRef.алк_ВариантыИтогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависитОтОпераций</name>
    <comment>Используется в механизме расчета показателей для настраиваемых отчетов</comment>
    <attributes>
      <name>ОперацияПроизводства</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВТ</name>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>CatalogRef.алк_ВТ_ДляРасчетаПоказателейПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_УпаковкаНоменклатуры/ManagerModule.bsl
#Область Инициализация

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУпаковкаНоменклатуры, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	алк_УпаковкаНоменклатурыПродукция.НомерСтроки,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.Дата КАК Период,
	|	алк_УпаковкаНоменклатурыПродукция.КлючСвязи,
	|	алк_УпаковкаНоменклатурыПродукция.Номенклатура,
	|	алк_УпаковкаНоменклатурыПродукция.Характеристика,
	|	алк_УпаковкаНоменклатурыПродукция.Количество,
	|	алк_УпаковкаНоменклатурыПродукция.ЗаказНаПроизводство.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВременнаяТаблицаПродукция
	|ИЗ
	|	Документ.алк_УпаковкаНоменклатуры.Продукция КАК алк_УпаковкаНоменклатурыПродукция
	|ГДЕ
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка КАК Ссылка,
	|	алк_УпаковкаНоменклатурыСерийныеНомераПродукция.СерийныйНомер,
	|	алк_УпаковкаНоменклатурыПродукция.Характеристика,
	|	алк_УпаковкаНоменклатурыПродукция.Количество КАК КоличествоСостав,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СертификацияПродукцииСрезПоследних.Сертификат, ЗНАЧЕНИЕ(Справочник.СертификатыНаПродукцию.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СертификатыНаПродукцию.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СертификатFSC,
	|	НАЧАЛОПЕРИОДА(алк_УпаковкаНоменклатурыПродукция.Ссылка.Дата, ГОД) КАК ПериодПакета,
	|	алк_УпаковкаНоменклатурыПродукция.Номенклатура,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.Дата КАК ПериодУпаковки,
	|	&Период,
	|	ВЫБОР
	|		КОГДА алк_УпаковкаНоменклатурыПродукция.Ссылка.Дата > ДАТАВРЕМЯ(2019, 7, 31, 23, 59, 59)
	|			ТОГДА алк_УпаковкаНоменклатурыПродукция.Ссылка.Сертификат
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СертификатыНаПродукцию.ПустаяСсылка)
	|	КОНЕЦ КАК Сертификат,
	|	алк_УпаковкаНоменклатурыПродукция.Припуск,
	|	алк_УпаковкаНоменклатурыПродукция.КатегорияНоменклатурыПЭО
	|ИЗ
	|	Документ.алк_УпаковкаНоменклатуры.Продукция КАК алк_УпаковкаНоменклатурыПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_УпаковкаНоменклатуры.СерийныеНомераПродукция КАК алк_УпаковкаНоменклатурыСерийныеНомераПродукция
	|		ПО алк_УпаковкаНоменклатурыПродукция.КлючСвязи = алк_УпаковкаНоменклатурыСерийныеНомераПродукция.КлючСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СертификацияПродукции.СрезПоследних(&Период, ) КАК СертификацияПродукцииСрезПоследних
	|		ПО алк_УпаковкаНоменклатурыПродукция.Номенклатура = СертификацияПродукцииСрезПоследних.Номенклатура
	|ГДЕ
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка = &Ссылка
	|	И алк_УпаковкаНоменклатурыСерийныеНомераПродукция.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка КАК Ссылка,
	|	алк_УпаковкаНоменклатурыСерийныеНомераПродукция.СерийныйНомер,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.Организация,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиница,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.ЯчейкаПродукции КАК Ячейка,
	|	1 КАК КоличествоПакетов,
	|	&ВидДвиженияНакопления КАК ВидДвижения,
	|	&Период,
	|	алк_УпаковкаНоменклатурыПродукция.Номенклатура
	|ИЗ
	|	Документ.алк_УпаковкаНоменклатуры.Продукция КАК алк_УпаковкаНоменклатурыПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_УпаковкаНоменклатуры.СерийныеНомераПродукция КАК алк_УпаковкаНоменклатурыСерийныеНомераПродукция
	|		ПО алк_УпаковкаНоменклатурыПродукция.КлючСвязи = алк_УпаковкаНоменклатурыСерийныеНомераПродукция.КлючСвязи
	|ГДЕ
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка = &Ссылка
	|	И алк_УпаковкаНоменклатурыСерийныеНомераПродукция.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПродукция.Период,
	|	ТаблицаПродукция.Период КАК ДатаСобытия,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Переупаковка) КАК Операция,
	|	ТаблицаПродукция.Номенклатура,
	|	ТаблицаПродукция.Характеристика,
	|	алк_УпаковкаНоменклатурыСерийныеНомераПродукция.СерийныйНомер
	|ИЗ
	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.алк_УпаковкаНоменклатуры.СерийныеНомераПродукция КАК алк_УпаковкаНоменклатурыСерийныеНомераПродукция
	|		ПО ТаблицаПродукция.Ссылка = алк_УпаковкаНоменклатурыСерийныеНомераПродукция.Ссылка
	|			И ТаблицаПродукция.КлючСвязи = алк_УпаковкаНоменклатурыСерийныеНомераПродукция.КлючСвязи
	|ГДЕ
	|	алк_УпаковкаНоменклатурыСерийныеНомераПродукция.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУпаковкаНоменклатуры);
	Запрос.УстановитьПараметр("Период", ДокументСсылкаУпаковкаНоменклатуры.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияНакопления", ВидДвиженияНакопления.Приход);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	
	ТабЗапроса = МассивРезультатов[1].Выгрузить();
	ТабЗапроса.Колонки.Добавить("НомерПакета", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(6,0, ДопустимыйЗнак.Неотрицательный)));
	
	//добавляем колонку документ для доп параметры пакетов
	ТабЗапроса.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.алк_УпаковкаНоменклатуры"));
	//\\
	
	Для каждого стрТаб Из ТабЗапроса Цикл
		стрТаб.НомерПакета = НоменклатураСервер.НомерСерии(стрТаб.СерийныйНомер);
		стрТаб.Документ = ДокументСсылкаУпаковкаНоменклатуры; 
	КонецЦикла; 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыПакетов", ТабЗапроса);  
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеПараметрыПакетов", ТабЗапроса);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКПоступлениюНаСкладыСерии", МассивРезультатов[2].Выгрузить());
	
	// Серийные номера
	РезультатЗапроса8 = МассивРезультатов[3].Выгрузить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", РезультатЗапроса8);
	Если СтруктураДополнительныеСвойства.УчетнаяПолитика.ОстаткиСерийныхНомеров Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", РезультатЗапроса8);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", Новый ТаблицаЗначений);
	КонецЕсли;
	
	СформироватьТаблицаЗапасыОрганизации(ДокументСсылкаУпаковкаНоменклатуры, СтруктураДополнительныеСвойства);   
	
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДокументСсылкаУпаковкаНоменклатуры.Дата) Тогда
		СформироватьТаблицуПроизводствоОборот(ДокументСсылкаУпаковкаНоменклатуры, СтруктураДополнительныеСвойства);
		СформироватьТаблицуОстаткиЗапасов(ДокументСсылкаУпаковкаНоменклатуры, СтруктураДополнительныеСвойства);
	КонецЕсли;
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --
	
	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти 


#Область Проведение

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыОрганизации(ДокументСсылкаУпаковкаНоменклатуры, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Номенклатура,
	|	&ВидДвиженияНакопленияПриход КАК ВидДвижения,
	|	&Период,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаУпаковку) КАК Операция,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.Организация,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.ДатаСмены,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.Смена,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.СтруктурнаяЕдиницаЗапасов КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка) КАК Ячейка,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Характеристика,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Количество,
	|	ВЫБОР
	|		КОГДА алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.Дата > ДАТАВРЕМЯ(2019, 7, 31, 23, 59, 59)
	|			ТОГДА алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.Сертификат
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СертификатыНаПродукцию.ПустаяСсылка)
	|	КОНЕЦ КАК Сертификат
	|ИЗ
	|	Документ.алк_УпаковкаНоменклатуры.ПродукцияПФ КАК алк_УпаковкаНоменклатурыПродукцияПФ
	|ГДЕ
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Номенклатура,
	|	&ВидДвиженияНакопленияРасход,
	|	&Период,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаУпаковку),
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.Организация,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.ДатаСмены,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.Смена,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.СтруктурнаяЕдиницаЗапасов,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.ЯчейкаЗапасов,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Характеристика,
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Количество,
	|	ВЫБОР
	|		КОГДА алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.Дата > ДАТАВРЕМЯ(2019, 7, 31, 23, 59, 59)
	|			ТОГДА алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка.Сертификат
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СертификатыНаПродукцию.ПустаяСсылка)
	|	КОНЕЦ
	|ИЗ
	|	Документ.алк_УпаковкаНоменклатуры.ПродукцияПФ КАК алк_УпаковкаНоменклатурыПродукцияПФ
	|ГДЕ
	|	алк_УпаковкаНоменклатурыПродукцияПФ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Период", РфпСервер.ПериодПроведения(ДокументСсылкаУпаковкаНоменклатуры));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУпаковкаНоменклатуры);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапасыОрганизации = МассивРезультатов[0].Выгрузить();
	ТаблицаЗапасыОрганизации.Колонки.Добавить("Объем");
	
	Для каждого стрТаблицы Из ТаблицаЗапасыОрганизации Цикл
		
		стрТаблицы.Объем = РфпПолучениеДанныхСервер.ОбъемПоХарактеристике(стрТаблицы.Характеристика) * стрТаблицы.Количество;	
		
	КонецЦикла; 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", ТаблицаЗапасыОрганизации);
	
	
КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации

Процедура СформироватьТаблицуПроизводствоОборот(ДокументСсылкаУпаковкаНоменклатуры, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано) КАК ВидДвиженияПроизводства,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.Организация,
	|	алк_УпаковкаНоменклатурыПродукция.Номенклатура КАК Номенклатура,
	|	алк_УпаковкаНоменклатурыСерийныеНомераПродукция.СерийныйНомер КАК СерийныйНомер,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.Сертификат КАК Сертификат,
	|	алк_УпаковкаНоменклатурыПродукция.Характеристика КАК Характеристика,
	|	ОКР(алк_УпаковкаНоменклатурыПродукция.Количество * алк_ПараметрыХарактеристик.Объем, 3) КАК Количество,
	|	ВЫБОР
	|		КОГДА алк_УпаковкаНоменклатурыПродукция.СерийныеНомера ПОДОБНО ""СП-%""
	|				ИЛИ алк_УпаковкаНоменклатурыПродукция.СерийныеНомера ПОДОБНО ""МС-%""
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Распил)
	|		КОГДА алк_УпаковкаНоменклатурыПродукция.СерийныеНомера ПОДОБНО ""НЗ-%""
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	|	КОНЕЦ КАК Операция,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.ДатаСмены,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.Смена,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.СтруктурнаяЕдиницаПродукции
	|ПОМЕСТИТЬ ВТ_Приход
	|ИЗ
	|	Документ.алк_УпаковкаНоменклатуры.Продукция КАК алк_УпаковкаНоменклатурыПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_УпаковкаНоменклатуры.СерийныеНомераПродукция КАК алк_УпаковкаНоменклатурыСерийныеНомераПродукция
	|		ПО алк_УпаковкаНоменклатурыПродукция.КлючСвязи = алк_УпаковкаНоменклатурыСерийныеНомераПродукция.КлючСвязи
	|			И алк_УпаковкаНоменклатурыПродукция.Ссылка = алк_УпаковкаНоменклатурыСерийныеНомераПродукция.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_УпаковкаНоменклатурыПродукция.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Приход.Дата КАК Период,
	|	ВТ_Приход.ВидДвиженияПроизводства КАК ВидДвиженияПроизводства,
	|	ВТ_Приход.ДатаСмены КАК ДатаСмены,
	|	ВТ_Приход.Номенклатура КАК Номенклатура,
	|	ВТ_Приход.Организация КАК Организация,
	|	ВТ_Приход.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_Приход.Сертификат КАК Сертификат,
	|	ВТ_Приход.СтруктурнаяЕдиницаПродукции КАК Склад,
	|	ВТ_Приход.Смена КАК Смена,
	|	ВТ_Приход.Характеристика КАК Характеристика,
	|	ВТ_Приход.Операция КАК Операция
	|ИЗ
	|	ВТ_Приход КАК ВТ_Приход";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУпаковкаНоменклатуры);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", ТаблицаРезультата);
	
КонецПроцедуры

Процедура СформироватьТаблицуОстаткиЗапасов(ДокументСсылкаУпаковкаНоменклатуры, СтруктураДополнительныеСвойства)
	
	Запрос = Новый  Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.Организация,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиница,
	|	алк_УпаковкаНоменклатурыПродукция.Номенклатура КАК Номенклатура,
	|	алк_УпаковкаНоменклатурыПродукция.Характеристика КАК Характеристика,
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка.Сертификат КАК Сертификат,
	|	алк_УпаковкаНоменклатурыСерийныеНомераПродукция.СерийныйНомер КАК СерийныйНомер,
	|	ОКР(алк_ПараметрыХарактеристик.Объем * алк_УпаковкаНоменклатурыПродукция.Количество, 3) КАК Количество
	|ПОМЕСТИТЬ ВТ_Приход
	|ИЗ
	|	Документ.алк_УпаковкаНоменклатуры.Продукция КАК алк_УпаковкаНоменклатурыПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_УпаковкаНоменклатуры.СерийныеНомераПродукция КАК алк_УпаковкаНоменклатурыСерийныеНомераПродукция
	|		ПО алк_УпаковкаНоменклатурыПродукция.Ссылка = алк_УпаковкаНоменклатурыСерийныеНомераПродукция.Ссылка
	|			И алк_УпаковкаНоменклатурыПродукция.КлючСвязи = алк_УпаковкаНоменклатурыСерийныеНомераПродукция.КлючСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_УпаковкаНоменклатурыПродукция.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_УпаковкаНоменклатурыПродукция.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Приход.Период,
	|	ВТ_Приход.ВидДвижения,
	|	ВТ_Приход.Организация,
	|	ВТ_Приход.СтруктурнаяЕдиница,
	|	ВТ_Приход.Номенклатура,
	|	ВТ_Приход.Характеристика,
	|	ВТ_Приход.Сертификат,
	|	ВТ_Приход.СерийныйНомер,
	|	ВТ_Приход.Количество
	|ИЗ
	|	ВТ_Приход КАК ВТ_Приход";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУпаковкаНоменклатуры);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", ТаблицаРезультата);
	
КонецПроцедуры




#КонецОбласти
